## Merging Dataframes

In [1]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                  {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                  {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                 index = ['Store 1', 'Store 1', 'Store 2'])

df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

    ## Note: In Dataframe above columns were created alphabetically
    ### Index: Row identifier

In [2]:
# To ADD A COLUMN to the Dataframe

df['Date'] = ['December 1', 'January 1', 'mid-May']
df

         Cost Item Purchased   Name        Date
Store 1  22.5         Sponge  Chris  December 1
Store 1   2.5   Kitty Litter  Kevyn   January 1
Store 2   5.0          Spoon  Filip     mid-May

In [5]:
# Adding new value, such as a delivery flag. Easy as it is a scalar value

df['Delivered'] = True
df

         Cost Item Purchased   Name        Date Delivered
Store 1  22.5         Sponge  Chris  December 1      True
Store 1   2.5   Kitty Litter  Kevyn   January 1      True
Store 2   5.0          Spoon  Filip     mid-May      True

In [6]:
# How to tackle incomplete data input. We have to add 'None' value ourselves

df['Feedback'] = ['Positive', None, 'Negative']
df

         Cost Item Purchased   Name        Date Delivered  Feedback
Store 1  22.5         Sponge  Chris  December 1      True  Positive
Store 1   2.5   Kitty Litter  Kevyn   January 1      True      None
Store 2   5.0          Spoon  Filip     mid-May      True  Negative

In [9]:
# Note: 'adf' and the NaN Date is given out of order
# Apparently pandas will put in missing values for us

adf = df.reset_index()
adf['Date'] = pd.Series({0: 'December 1', 2: 'mid-May'})
adf

     index  Cost Item Purchased   Name        Date Delivered  Feedback
0  Store 1  22.5         Sponge  Chris  December 1      True  Positive
1  Store 1   2.5   Kitty Litter  Kevyn         NaN      True      None
2  Store 2   5.0          Spoon  Filip     mid-May      True  Negative

## Merging large dataframes: Language
    ### Set Theory: Union = Full outer join 
    ### Set Theory: Intersection = Inner join

In [14]:
# Creating two dataframes

staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                        {'Name': 'Sally', 'Role': 'Course liaison'},
                        {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name':'James', 'School':'Business'},
                          {'Name': 'Mike', 'School': 'Law'},
                          {'Name':'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')

print(staff_df)
print()
print(student_df)

                 Role
Name
Kelly  Director of HR
Sally  Course liaison
James          Grader

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [15]:
# Merging Dataframes: Curly brackets (UNION)
# pd.merge(df_1, df_2, how='outer'/'inner', left_index=T/F, right_index=T/F)

pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liaison  Engineering

In [16]:
# Merging Dataframes: Curly brackets (INTERSECTION)
# pd.merge(df_1, df_2, how='outer'/'inner', left_index=T/F, right_index=T/F)

pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Sally  Course liaison  Engineering

In [18]:
# You can also 'join' from the left or right. 
# That is list of all 'Students' or 'Staff'
# pd.merge(df_1, df_2, how='left'/'right, left_index=T/F, right_index=T/F))

pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liaison  Engineering
James          Grader     Business

In [19]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liaison  Engineering

In [20]:
# Don't need to use indices to join, can use columns as well

staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liaison  Engineering
2  James          Grader     Business

In [23]:
# What if there is data difference between df left and df right?

staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                        {'Name': 'Sally', 'Role': 'Course liaison', 'Location': 'Washington Avenue'},
                        {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])

student_df = pd.DataFrame([{'Name':'James', 'School':'Business', 'Location':'1024 Billiard Avenue'},
                          {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                          {'Name':'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])


pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

          Location_x   Name            Role            Location_y       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liaison   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [38]:
# Video Question

import pandas as pd

products_df = pd.DataFrame([{'Product ID': 4109, 'Price': 5.0, 'Product': 'Sushi Roll'},
                           {'Product ID': 1412, 'Price': 0.5, 'Product': 'Egg'},
                           {'Product ID': 8931, 'Price': 1.5, 'Product': 'Bagel'}])
products_df = products_df.set_index('Product ID')

invoices_df = pd.DataFrame([{'Customer': 'Ali', 'Product ID': 4109, 'Quantity': 1},
                           {'Customer': 'Eric', 'Product ID': 1412, 'Quantity': 12},
                           {'Customer': 'Ande', 'Product ID': 8931, 'Quantity': 6},
                           {'Customer': 'Sam', 'Product ID': 4109, 'Quantity': 2}])

print(products_df)
print()
print(invoices_df)

            Price     Product
Product ID
4109          5.0  Sushi Roll
1412          0.5         Egg
8931          1.5       Bagel

  Customer  Product ID  Quantity
0      Ali        4109         1
1     Eric        1412        12
2     Ande        8931         6
3      Sam        4109         2

In [36]:
# My solution
products_df = products_df.reset_index()
invoices_df = invoices_df.reset_index()
pd.merge(products_df, invoices_df, how='left', left_on='Product ID', right_on='Product ID')

   Product ID  Price     Product  index Customer  Quantity
0        4109    5.0  Sushi Roll      0      Ali         1
1        4109    5.0  Sushi Roll      3      Sam         2
2        1412    0.5         Egg      1     Eric        12
3        8931    1.5       Bagel      2     Ande         6

In [42]:
# Their Solution
pd.merge(products_df, invoices_df, how='left', left_index=True, right_on='Product ID')

   Price     Product Customer  Product ID  Quantity
0    5.0  Sushi Roll      Ali        4109         1
3    5.0  Sushi Roll      Sam        4109         2
1    0.5         Egg     Eric        1412        12
2    1.5       Bagel     Ande        8931         6

In [48]:
# Repeated in video

staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'DesJardins', 'Role': 'Director of HR'},
                        {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liaison'},
                        {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])

student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School':'Business'},
                          {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                          {'First Name':'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])


print(staff_df)
print()
print(student_df)
print()
print(pd.merge(staff_df, student_df, how='inner', left_on=['First Name', 'Last Name'], right_on=['First Name', 'Last Name']))

  First Name   Last Name            Role
0      Kelly  DesJardins  Director of HR
1      Sally      Brooks  Course liaison
2      James       Wilde          Grader

  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

  First Name Last Name            Role       School
0      Sally    Brooks  Course liaison  Engineering